
<h2><a name="sever">אודות</a></h2>
<p><strong>מנוע השרת</strong></p>
<p>שרת רשת זה מפעיל את תכנת HOCR, תכנה לזיהוי אותיות אופטי.</p>
<ul>
  <li>אתר הבית של התכנה : <a href="http://hocr.berlios.de">http://hocr.berlios.de</a></li> 
  <li>כתובת להערות והארות אודות התכנה: <a href="mailto:kzamir_walla.co.il">kzamir_walla.co.il</a></li>
</ul>
<p><strong>מאפיינים טכניים</strong></p>
<ul>
  <li>מנח טקסט מותר: אופקי</li>
  <li>מזהה את חלקי הטקסט הבאים:
    <ul>
      <li>דף</li>
      <li>בלוק טקסט</li>
      <li>שורה</li>
      <li>מילה</li>
      <li>אות</li>
    </ul>
  </li>
  <li>סוגי אותיות: דפוס</li>
  <li>גודל תמונה מקסימאלי בפיקסלים:	5000*5000</li>
  <li>קידודי תמונה נתמכים: png, jpeg, tiff, gif</li>
  <li>קידודי טקסט נתמכים: utf-8 (עברית בלבד)</li>
</ul>
<p><strong>תכנות נוספות בהן נעשה שימוש</strong></p>
<ul>
  <li>ImageMagic: להמרת תסדירי הקבצים הגרפיים <a href="http://www.imagemagick.org">(אתר)</a></li>
  <li>hspell: בדיקת איות בשפה העברית <a href="http://ivrix.org.il/projects/spell-checker/">(אתר)</a></li>
  <li>php: שפה לצד השרת <a href="http://php.net">(אתר)</a></li>
</ul>
<p class="top"><a href="#hocr_web">ראשית</a></p> 
<h2><a name="usage">שימוש</a></h2>
<p>
מלאו את שדה הקובץ בטופס שבתחילת העמוד, לאחר מכן לחצו על כפתור 'שלח תמונה לזיהוי' והמתינו. 
לאחר שהתמונה תשלח, יופיע עמוד חדש, ובו הודעה לגבי הצלחה או כשלון של פעולת העלאת הקובץ. 
אם העלאת הקובץ הצליחה, תופעל תכנת HOCR על הקובץ שנשלח. הדף יתמלה בהודעות המערכת של התכנה. 
מילוי הדף יסתיים כאשר התכנה תסיים את פעולתה. קבצי הטקסט והתמונות המעובדות יופיעו בספריית הפלט.
</p>
<p>
כאשר התכנה תסיים לעבד את התמונה, יופיעו הקבצים הבאים בספריית הפלט:
</p>
<ul>
  <li>התמונה המקורית</li>
  <li>תמונה המכילה פרטים על ניתוח העימוד והאותיות שזוהו, התמונה מיועדת לעזור להגהת הטקסט שזוהה, שמורה כ "שם הקובץ"-L עם סיומת jpeg</li>
  <li>הטקסט שזוהה, שמור כ "שם הקובץ" עם סיומת txt</li>
</ul>
<p><b>עיבוד התמונה אורך זמן רב, היו סבלניים. אין לסגור את דף הדפדפן במהלך תהליך הזיהוי.</b></p>
<p class="top"><a href="#hocr_web">ראשית</a></p> 
<h2><a name="files">שימוש נאות</a></h2>
<p>
עיבוד תמונה צורך משאבי מערכת רבים.
בדוק את התרשומת בסוף העמוד כדי לוודא שהמערכת לא עובדת כרגע על תמונה אחרת. אם המערכת תנסה לזהות מספר תמונות במקביל היא עלולה להפסיק לפעול ללא אזהרה, עקב מחסור בזיכרון.
</p>
<p class="top"><a href="#hocr_web">ראשית</a></p> 
<h2><a name="log">תרשומת</a></h2>

<div class="code">
  <p><object data="<?php print $log_path; ?>" width="100%"></object></p>
</div>

<p class="top"><a href="#hocr_web">ראשית</a></p>
